{
	"messages": [
		{
			"label": "WELCOME_MESSAGE",
			"language": "ENGLISH",
			"message": {
				"content": null,
				"embeds": [
					{
						"author": {
							"name": "English｜Englisch",
							"url": null,
							"icon_url": "https://cdn-icons-png.flaticon.com/512/197/197484.png"
						},
						"title": "Welcome to the Official ACSP Discord Server!",
						"description": "Your journey as a computer scientist starts right here! \n\n**What is this?**\nAkjo's Computer Science Program (ACSP) is an interactive and fully flexible program, that will teach you the fundamentals of computer science and gives you the option to dive deep into the complex world of computer science, even allowing you to acquire some official certificates along the way (if you want). The program is fully flexible and individual, which means that you can progress at your own pace and take your own path, depending on the courses, challenges, tasks, etc. you complete! \n\nYou can also opt out at any point, if you think your journey is over or you think that this isn't something for you (please tell us if we can improve something in one of the feedback channels)!\n\nThe program is still in its infancy, so many things aren't available yet. We keep expanding the program so you can keep learning. Just stay tuned for updates!\n\n**Why this server?**\nThis discord server is not only your entrance into the program and a welcome page. As soon as you begin, you will be able to keep track of your progress, meet others on their journey, get updates from us about the course and be able to talk about anything you want! You can show off your cool projects that you made and get feedback for them. Maybe some big open source projects will arise? It's all about the community and learning computer science!\n\n**How does this work?**\nBehind the scenes ASCP is pretty complex. Don't worry you will understand eventually, as you progress through the program. \n\nThere are two main places that you interact with: This discord server and the official app. You will learn more about the app and how to use it as soon as you begin.\n\nThe whole program is split into many different segments that you progress through one at a time. \n\nThe first two are special segments to introduce you to the program and setup everything, so you can start your journey, and to evaluate your current knowledge to give you an initial level. You obviously will still be able to go through all earlier segments/modules, if you want to. After these two segments everything will be individual. You might even have to take an additional segment, that isn't part of the main progression, where you will learn all the basic computer fundamentals to even handle computers in the first place and progress further through the program. \n\nAll subsequent segments in the main progression line will be unlocked depending on the skill level you have. There are certain topic lines that will be outside of the main progression that will still count towards your level. The initial level you will get will be decided by the knowledge evaluation segment. You will only be able to do it once, so take your time! The topic lines might also unlock to a certain module, depending on the knowledge evaluation.\n\nDepending on the segments/modules you are currently enrolled in, you will either use discord directly or most of the time will use the app to go through the module contents.\n\nOn your journey you will be able to do so much that just can't fit here. We have so much planned, so just stay tuned for updates and begin at... well the beginning! You will get the hang of everything eventually.\n\n**How can I begin?**\nBefore you begin please review our <#1073273398693724332>. As soon as you're ready, go to <#1073346501314629732> and type */begin* into the chat! \n\n*(at the bottom there is an input field where you can input text, when you've finished press Enter on your keyboard to send what you have written into that input field to the #begin chat . The program will guide you through the rest!)*",
						"url": null,
						"color": "#202225",
						"fields": [],
						"image_url": null,
						"thumbnail_url": null,
						"footer": {
							"text": "Written by Akjo#3012",
							"timestamp": "2023-02-10 19:00",
							"icon_url": null
						}
					}
				]
			}
		},
		{
			"label": "WELCOME_MESSAGE",
			"language": "GERMAN",
			"message": {
				"content": null,
				"embeds": [
					{
						"author": {
							"name": "Deutsch｜German",
							"url": null,
							"icon_url": "https://cdn-icons-png.flaticon.com/512/197/197571.png"
						},
						"title": "Wilkommen auf dem offiziellen CSC Discord Server!",
						"description": "Deine Reise als Informatiker/in beginnt genau hier!\n\n**Was ist das Ganze hier?**\nAkjo's Computer Science Program (ACSP) ist ein interaktives und völlig flexibles Programm, das dir die Grundlagen der Informatik beibringt und dir die Möglichkeit gibt, tief in die komplexe Welt der Informatik einzutauchen und dabei sogar einige offizielle Zertifikate zu erwerben (wenn du willst). Das Programm ist völlig flexibel und individuell, was bedeutet, dass du in deinem eigenen Tempo vorankommen und deinen eigenen Weg gehen kannst, je nachdem, welche Kurse, Herausforderungen, Aufgaben usw. du absolvierst!\n\nDu kannst auch jederzeit aussteigen, wenn du denkst, dass deine Reise zu Ende ist oder wenn du meinst, dass dies nichts für dich ist (bitte sag uns in einem der Feedback-Kanäle, ob wir etwas verbessern können)!\n\nDas Programm steckt noch in den Startlöchern, daher sind viele Dinge noch nicht verfügbar. Wir erweitern das Programm ständig, so dass du immer weiter lernen kannst. Bleib einfach dran für Updates!\n\n**Warum dieser Server?**\nDieser Discord-Server ist nicht nur dein Einstieg in das Programm und eine Willkommensseite. Sobald du anfängst, kannst du hier deinen Fortschritt verfolgen, andere auf ihrer Reise treffen, Updates von uns über das Lernprogramm erhalten und über alles reden, was du willst! Du kannst mit deinen coolen Projekten angeben und Feedback dazu bekommen. Vielleicht entstehen ja einige große Open-Source-Projekte? Es geht um die Community und darum, Informatik zu lernen!\n\n**Wie funktioniert das?**\nIm Hintergrund ist ASCP ziemlich komplex. Aber keine Sorge, du wirst es mit der Zeit verstehen, während du das Programm durchläufst.\n\nEs gibt zwei wichtige Orte, mit denen du interagierst: Dieser Discord-Server und die offizielle App. Sobald du anfängst, wirst du mehr über die App und ihre Verwendung erfahren.\n\nDas gesamte Programm ist in viele verschiedene Segmente unterteilt, die du nacheinander durchläufst.\n\nDie ersten beiden sind spezielle Segmente, um dich in das Programm einzuführen und alles so einzurichten, dass du deine Reise starten kannst, und um dein aktuelles Wissen zu bewerten, um dir ein erstes Level zu geben. Natürlich kannst du auch alle früheren Abschnitte/Module durcharbeiten, wenn du das möchtest. Nach diesen beiden Segmenten wird alles individuell sein. Es kann sogar sein, dass du ein zusätzliches Segment absolvieren musst, das nicht Teil der Hauptreihe ist, in dem du alle grundlegenden Computerkenntnisse lernst, um überhaupt mit Computern umgehen zu können, damit du im Programm weiterkommst.\n\nAlle weiteren Abschnitte in der Hauptreihe werden in Abhängigkeit von deinem Level freigeschaltet. Es gibt bestimmte Themenreihen, die außerhalb der Hauptreihe liegen, die aber trotzdem zu deinem Level zählen. Das anfängliche Level, dass du erhältst, wird durch das Segment zur Wissenseinschätzung bestimmt. Das kannst du nur einmal machen, also nimm dir Zeit! Abhängig von der Wissenseinschätzung können die Themenreihen auch bis zu einem bestimmten Modul freigeschaltet werden.\n\nAbhängig von den Segmenten/Modulen, in denen du gerade eingeschrieben bist, wirst du entweder Discord direkt nutzen oder die meiste Zeit die App verwenden, um die Modulinhalte durchzugehen.\n\nAuf deiner Reise wirst du noch so viel machen können, was hier einfach nicht Platz hat. Wir haben so viel geplant, also haltet euch einfach auf dem Laufenden und fangt am... nun ja, am Anfang an! Irgendwann wirst du den Dreh raus haben.\n\n**Wie kann ich anfangen?**\nBevor du beginnst, lies bitte unsere <#1073273398693724332> (Regeln). Sobald du bereit bist, gehe zu <#1073346501314629732> und gib */begin* in den Chat ein!\n\n*(unten befindet sich ein Eingabefeld, in das du Text eingeben kannst. Wenn du fertig bist, drücke die Eingabetaste auf deiner Tastatur, um das, was du in das Eingabefeld geschrieben hast, an den #begin-Chat zu senden. Das Programm wird dich dann durch den Rest begleiten!)*",
						"url": null,
						"color": "#202225",
						"fields": [],
						"image_url": null,
						"thumbnail_url": null,
						"footer": {
							"text": "Geschrieben von Akjo#3012",
							"timestamp": "2023-02-10 19:00",
							"icon_url": null
						}
					}
				]
			}
		}
	],
	"strings": [
		{
			"label": "COMMAND_DESCRIPTION_REFRESH_WELCOME",
			"language": "ENGLISH",
			"value": "Refreshes the welcome messages."
		},
		{
			"label": "COMMAND_DESCRIPTION_REFRESH_WELCOME",
			"language": "GERMAN",
			"value": "Aktualisiert die Willkommensnachrichten."
		},
		{
			"label": "COMMAND_ARG_DESCRIPTION_REFRESH_WELCOME_LANGUAGE",
			"language": "ENGLISH",
			"value": "The language of the welcome message to refresh."
		},
		{
			"label": "COMMAND_ARG_DESCRIPTION_REFRESH_WELCOME_LANGUAGE",
			"language": "GERMAN",
			"value": "Die Sprache der Willkommensnachricht, die aktualisiert werden soll."
		}
	],
	"commands": [
		{
			"command": "refreshWelcome",
			"subcommands": {
				"available": false,
				"definitions": []
			},
			"description": "$COMMAND_DESCRIPTION_REFRESH_WELCOME",
			"arguments": [
				{
					"name": "language",
					"type": "CHOICE",
					"description": "$COMMAND_ARG_DESCRIPTION_REFRESH_WELCOME_LANGUAGE",
					"required": false,
					"data": {
						"choices": [
							{
								"names": [
									"english",
									"en"
								],
								"case_sensitive": false,
								"value": "ENGLISH"
							},
							{
								"names": [
									"deutsch",
									"de"
								],
								"case_sensitive": false,
								"value": "GERMAN"
							}
						],
						"choice_exclusive": true
					}
				}
			],
			"permissions": [
				{
					"channels": [
						">ADMIN_CATEGORY"
					],
					"roles": [
						"ADMIN_ROLE"
					]
				}
			]
		}
	],
	"command_prefix": "!"
}